vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW716C_DFP.pdsc
<?xml version='1.0' encoding='UTF-8'?>
<package xmlns:xs='http://www.w3.org/2001/XMLSchema-instance' xs:noNamespaceSchemaLocation='PACK.xsd' schemaVersion='1.4'>
  <name>MCXW716C_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MCXW716C</description>
  <url>https://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version='25.03.00' date='2025-03-28'>NXP CMSIS Packs based on MCUXpresso SDK 25.03.00</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <requirements>
    <packages>
      <package name='CMSIS' vendor='ARM' version='6.1.0'/>
    </packages>
    <languages>
      <language name='C' version='99'/>
    </languages>
  </requirements>
  <devices>
    <family Dfamily='MCXW716C' Dvendor='NXP:11'>
      <description>Ultra-low power, Highly Secure, Bluetooth LE 5.3 Wireless MCU with CAN-FD.</description>
      <device Dname='MCXW716CxxxA'>
        <processor Dcore='Cortex-M33' Dfpu='SP_FPU' Dmpu='MPU' Dtz='TZ' Ddsp='DSP' Dendian='Little-endian' Dclock='96000000'/>
        <environment name='iar'>
          <file category='linkerfile' name='devices/MCXW716C/iar/mcxw716_flash.icf'/>
        </environment>
        <memory name='PROGRAM_FLASH' start='0x00000000' size='0x100000' access='rx' default='1' startup='1'/>
        <memory name='TCM_CODE' start='0x04000000' size='0x4000' access='rw' default='1'/>
        <memory name='TCM_SYS' start='0x20000000' size='0x01c000' access='rw' default='1'/>
        <debug partnumber='MCXW716CxxxA'/>
        <variant Dvariant='MCXW716CMFTA'>
          <compile header='devices/MCXW716C/fsl_device_registers.h' define='CPU_MCXW716CMFTA'/>
        </variant>
        <variant Dvariant='MCXW716CMFPA'>
          <compile header='devices/MCXW716C/fsl_device_registers.h' define='CPU_MCXW716CMFPA'/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id='device.MCXW716C.internal_condition'>
      <accept Dname='MCXW716CMFPA' Dvendor='NXP:11'/>
      <accept Dname='MCXW716CMFTA' Dvendor='NXP:11'/>
    </condition>
    <condition id='cmake_toolchain.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.device=MCXW716C.internal_condition'>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.at_least_one_i2c_mux_device_enabled.condition_id'>
      <require condition='allOf.component.i2c_mux_pca954x, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.component.i2c_mux_pca954x, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i2c_mux_pca954x'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.button.condition_id'>
      <require condition='allOf.anyOf=allOf=component.gpio_adapter, driver.gpio, component.timer_manager, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=allOf=component.gpio_adapter, driver.gpio, component.timer_manager, device=MCXW716C.internal_condition'>
      <require condition='anyOf.allOf=component.gpio_adapter, driver.gpio.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='timer_manager'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=component.gpio_adapter, driver.gpio.internal_condition'>
      <accept condition='allOf.component.gpio_adapter, driver.gpio.internal_condition'/>
    </condition>
    <condition id='allOf.component.gpio_adapter, driver.gpio.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpio_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpio'/>
    </condition>
    <condition id='component.cmsis_drivers.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.crc_adapter.condition_id'>
      <require condition='allOf.driver.crc, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.driver.crc, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='crc'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.debug_coredump.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.debug_coredump_backend.flash_partition.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.debug_coredump_backend.mflash.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.debug_thread_info.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='device_id.MCXW716CxxxA.internal_condition'>
      <accept Dname='MCXW716CMFPA' Dvendor='NXP:11'/>
      <accept Dname='MCXW716CMFTA' Dvendor='NXP:11'/>
    </condition>
    <condition id='component.eeprom_emulation.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device_id.MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='component.enable_pca9544.condition_id'>
      <require condition='allOf.component.i2c_mux_pca954x, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.enable_pca9548.condition_id'>
      <require condition='allOf.component.i2c_mux_pca954x, device=MCXW716C.internal_condition'/>
    </condition>
