vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW716C_DFP.pdsc
    <condition id='component.flash_adapter.condition_id'>
      <require condition='allOf.anyOf=allOf=component.k4_flash_adapter, driver.flash_k4, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=allOf=component.k4_flash_adapter, driver.flash_k4, device=MCXW716C.internal_condition'>
      <require condition='anyOf.allOf=component.k4_flash_adapter, driver.flash_k4.internal_condition'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=component.k4_flash_adapter, driver.flash_k4.internal_condition'>
      <accept condition='allOf.component.k4_flash_adapter, driver.flash_k4.internal_condition'/>
    </condition>
    <condition id='allOf.component.k4_flash_adapter, driver.flash_k4.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='k4_flash_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flash_k4'/>
    </condition>
    <condition id='component.flash_nor_lpspi.condition_id'>
      <require condition='allOf.driver.lpspi, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.driver.lpspi, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpspi'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.gen_hal.condition_id'>
      <require condition='allOf.component.zephyr_headers, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.component.zephyr_headers, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.gen_hal.clock_control.condition_id'>
      <require condition='allOf.component.gen_hal, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.component.gen_hal, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gen_hal'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.gen_hal.clock_control.mcux_syscon.condition_id'>
      <require condition='allOf.component.gen_hal, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.gen_hal.flash.condition_id'>
      <require condition='allOf.component.gen_hal, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.gen_hal.memc.condition_id'>
      <require condition='allOf.component.gen_hal, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.gen_hal.osa.condition_id'>
      <require condition='allOf.component.zephyr_headers.kernel, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.component.zephyr_headers.kernel, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_kernel'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.gen_hal.pinctrl.condition_id'>
      <require condition='allOf.component.gen_hal, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.gpio_adapter.condition_id'>
      <require condition='allOf.anyOf=driver.port, driver.gpio, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.port, driver.gpio, device=MCXW716C.internal_condition'>
      <require condition='anyOf.driver.port.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpio'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='anyOf.driver.port.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='port'/>
    </condition>
    <condition id='component.i2c_adapter_interface.condition_id'>
      <require condition='allOf.anyOf=allOf=anyOf=driver.lpi2c, component.lpi2c_adapter, allOf=component.i3c_adapter, driver.i3c, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=allOf=anyOf=driver.lpi2c, component.lpi2c_adapter, allOf=component.i3c_adapter, driver.i3c, device=MCXW716C.internal_condition'>
      <require condition='anyOf.allOf=anyOf=driver.lpi2c, component.lpi2c_adapter, allOf=component.i3c_adapter, driver.i3c.internal_condition'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=anyOf=driver.lpi2c, component.lpi2c_adapter, allOf=component.i3c_adapter, driver.i3c.internal_condition'>
      <accept condition='allOf.anyOf=driver.lpi2c, component.lpi2c_adapter.internal_condition'/>
      <accept condition='allOf.component.i3c_adapter, driver.i3c.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.lpi2c, component.lpi2c_adapter.internal_condition'>
      <require condition='anyOf.driver.lpi2c.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpi2c_adapter'/>
    </condition>
    <condition id='anyOf.driver.lpi2c.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='i2c'/>
    </condition>
    <condition id='allOf.component.i3c_adapter, driver.i3c.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i3c_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i3c'/>
    </condition>
    <condition id='component.i2c_mux.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.i2c_mux_pca954x.condition_id'>
      <require condition='allOf.component.i2c_mux, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.component.i2c_mux, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i2c_mux'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.i3c_adapter.condition_id'>
      <require condition='allOf.component.i2c_adapter_interface, driver.i3c, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.component.i2c_adapter_interface, driver.i3c, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i2c_adapter_interface'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i3c'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.k4_flash_adapter.condition_id'>
      <require condition='allOf.anyOf=driver.flash_k4, driver.flash_k4, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.flash_k4, driver.flash_k4, device=MCXW716C.internal_condition'>
      <require condition='anyOf.driver.flash_k4.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flash_k4'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='anyOf.driver.flash_k4.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='flash_k4'/>
    </condition>
    <condition id='component.led.condition_id'>
      <require condition='allOf.anyOf=allOf=component.gpio_adapter, driver.gpio, component.timer_manager, driver.common, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=allOf=component.gpio_adapter, driver.gpio, component.timer_manager, driver.common, device=MCXW716C.internal_condition'>
      <require condition='anyOf.allOf=component.gpio_adapter, driver.gpio.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='timer_manager'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.lists.condition_id'>
      <require condition='allOf.driver.common, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.log.condition_id'>
      <require condition='allOf.driver.common, utility.str, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, utility.str, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='str'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.log.backend.debug_console.condition_id'>
      <require condition='allOf.component.log, driver.common, utility.debug_console, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.component.log, driver.common, utility.debug_console, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='log'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.log.backend.debug_console_lite.condition_id'>
      <require condition='allOf.component.log, driver.common, utility.debug_console_lite, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.component.log, driver.common, utility.debug_console_lite, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='log'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console_lite'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.log.backend.ringbuffer.condition_id'>
      <require condition='allOf.component.log, driver.common, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.component.log, driver.common, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='log'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.lpadc_sensor_adapter.condition_id'>
      <require condition='allOf.driver.lpadc, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.driver.lpadc, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpadc'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.lpi2c_adapter.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, component.i2c_adapter_interface, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.lpi2c, component.i2c_adapter_interface, device=MCXW716C.internal_condition'>
      <require condition='anyOf.driver.lpi2c.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i2c_adapter_interface'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.lpit_adapter.condition_id'>
      <require condition='allOf.driver.lpit, device=MCXW716C.internal_condition'/>
    </condition>
