vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW716C_DFP.pdsc
    <condition id='allOf.driver.lpit, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpit'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.lpit_time_stamp_adapter.condition_id'>
      <require condition='allOf.driver.lpit, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.lpspi_adapter.condition_id'>
      <require condition='allOf.driver.common, driver.lpspi, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, driver.lpspi, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpspi'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.lptmr_adapter.condition_id'>
      <require condition='allOf.driver.lptmr, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.driver.lptmr, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lptmr'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.lptmr_time_stamp_adapter.condition_id'>
      <require condition='allOf.driver.lptmr, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.lpuart_adapter.condition_id'>
      <require condition='allOf.anyOf=driver.lpuart, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.lpuart, device=MCXW716C.internal_condition'>
      <require condition='anyOf.driver.lpuart.internal_condition'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='anyOf.driver.lpuart.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart'/>
    </condition>
    <condition id='component.mcux-edgelock.s200.condition_id'>
      <require condition='allOf.board=mcxw71evk, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.board=mcxw71evk, device=MCXW716C.internal_condition'>
      <require condition='board.mcxw71evk.internal_condition'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='board.mcxw71evk.internal_condition'>
      <accept condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.mem_manager.condition_id'>
      <require condition='allOf.anyOf=component.mem_manager_legacy, component.mem_manager_light, component.lists, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=component.mem_manager_legacy, component.mem_manager_light, component.lists, device=MCXW716C.internal_condition'>
      <require condition='anyOf.component.mem_manager_legacy, component.mem_manager_light.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lists'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='anyOf.component.mem_manager_legacy, component.mem_manager_light.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='mem_manager_legacy'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='mem_manager_light'/>
    </condition>
    <condition id='component.mem_manager_legacy.condition_id'>
      <require condition='allOf.component.mem_manager, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.component.mem_manager, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='mem_manager'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.mem_manager_light.condition_id'>
      <require condition='allOf.component.mem_manager, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.messaging.condition_id'>
      <require condition='allOf.component.lists, component.mem_manager, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.component.lists, component.mem_manager, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lists'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='mem_manager'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.mflash_onchip.condition_id'>
      <require condition='allOf.anyOf=driver.flash_k4, driver.mcm, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.flash_k4, driver.mcm, device=MCXW716C.internal_condition'>
      <require condition='anyOf.driver.flash_k4, driver.mcm.internal_condition'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='anyOf.driver.flash_k4, driver.mcm.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='flash_k4'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='mcm'/>
    </condition>
    <condition id='component.mflash_onchip_fmu.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.panic.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.power_manager_framework.condition_id'>
      <require condition='allOf.anyOf=driver.cmc, driver.common, driver.crc, driver.spc, driver.vbat, driver.wuu, component.lists, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.cmc, driver.common, driver.crc, driver.spc, driver.vbat, driver.wuu, component.lists, device=MCXW716C.internal_condition'>
      <require condition='anyOf.driver.cmc, driver.common, driver.crc, driver.spc, driver.vbat, driver.wuu.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lists'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='anyOf.driver.cmc, driver.common, driver.crc, driver.spc, driver.vbat, driver.wuu.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='cmc'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='crc'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='spc'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='vbat'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='wuu'/>
    </condition>
    <condition id='component.pwm_tpm_adapter.condition_id'>
      <require condition='allOf.driver.tpm, device=MCXW716C.internal_condition'/>
    </condition>
