vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW716C_DFP.pdsc
    <condition id='allOf.driver.tpm, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='tpm'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.reset_adapter.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='device.MCXW716A.internal_condition'>
      <accept Dname='MCXW716AMFPA' Dvendor='NXP:11'/>
      <accept Dname='MCXW716AMFTA' Dvendor='NXP:11'/>
    </condition>
    <condition id='component.rpmsg_adapter.condition_id'>
      <require condition='allOf.board=frdmmcxw7x, frdmmcxw71, mcxw71evk, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.board=frdmmcxw7x, frdmmcxw71, mcxw71evk, device=MCXW716C.internal_condition'>
      <require condition='board.frdmmcxw7x, frdmmcxw71, mcxw71evk.internal_condition'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='board.frdmmcxw7x, frdmmcxw71, mcxw71evk.internal_condition'>
      <accept condition='device.MCXW716A.internal_condition'/>
      <accept condition='device.MCXW716C.internal_condition'/>
      <accept condition='device.MCXW716A.internal_condition'/>
      <accept condition='device.MCXW716C.internal_condition'/>
      <accept condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.rtc_adapter.condition_id'>
      <require condition='allOf.driver.rtc, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.driver.rtc, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='rtc'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.serial_manager.condition_id'>
      <require condition='allOf.anyOf=component.serial_manager_rpmsg, component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=component.serial_manager_rpmsg, component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MCXW716C.internal_condition'>
      <require condition='anyOf.component.serial_manager_rpmsg, component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lists'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='anyOf.component.serial_manager_rpmsg, component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_rpmsg'/>
      <accept Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_spi'/>
      <accept Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_swo'/>
      <accept Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_uart'/>
      <accept Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_virtual'/>
    </condition>
    <condition id='component.serial_manager_rpmsg.condition_id'>
      <require condition='allOf.component.rpmsg_adapter, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.component.rpmsg_adapter, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='rpmsg_adapter'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.serial_manager_spi.condition_id'>
      <require condition='allOf.anyOf=allOf=component.lpspi_adapter, driver.lpspi, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=allOf=component.lpspi_adapter, driver.lpspi, device=MCXW716C.internal_condition'>
      <require condition='anyOf.allOf=component.lpspi_adapter, driver.lpspi.internal_condition'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=component.lpspi_adapter, driver.lpspi.internal_condition'>
      <accept condition='allOf.component.lpspi_adapter, driver.lpspi.internal_condition'/>
    </condition>
    <condition id='allOf.component.lpspi_adapter, driver.lpspi.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpspi_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpspi'/>
    </condition>
    <condition id='component.serial_manager_swo.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.serial_manager_uart.condition_id'>
      <require condition='allOf.component.lpuart_adapter, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.component.lpuart_adapter, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart_adapter'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.serial_manager_virtual.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.silicon_id_imx8.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.silicon_id_imx93.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.silicon_id_imxrt10xx.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.silicon_id_imxrt1170.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.silicon_id_imxrt1180.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
