vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW716C_DFP.pdsc
    <condition id='component.silicon_id_rw610.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.silicon_id_scfw.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.software_crc_adapter.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.software_rng_adapter.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.timer_manager.condition_id'>
      <require condition='allOf.anyOf=allOf=component.lpit_adapter, driver.lpit, allOf=component.lptmr_adapter, driver.lptmr, allOf=component.tpm_adapter, driver.tpm, component.lists, driver.common, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=allOf=component.lpit_adapter, driver.lpit, allOf=component.lptmr_adapter, driver.lptmr, allOf=component.tpm_adapter, driver.tpm, component.lists, driver.common, device=MCXW716C.internal_condition'>
      <require condition='anyOf.allOf=component.lpit_adapter, driver.lpit, allOf=component.lptmr_adapter, driver.lptmr, allOf=component.tpm_adapter, driver.tpm.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lists'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=component.lpit_adapter, driver.lpit, allOf=component.lptmr_adapter, driver.lptmr, allOf=component.tpm_adapter, driver.tpm.internal_condition'>
      <accept condition='allOf.component.lpit_adapter, driver.lpit.internal_condition'/>
      <accept condition='allOf.component.lptmr_adapter, driver.lptmr.internal_condition'/>
      <accept condition='allOf.component.tpm_adapter, driver.tpm.internal_condition'/>
    </condition>
    <condition id='allOf.component.lpit_adapter, driver.lpit.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpit_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpit'/>
    </condition>
    <condition id='allOf.component.lptmr_adapter, driver.lptmr.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lptmr_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lptmr'/>
    </condition>
    <condition id='allOf.component.tpm_adapter, driver.tpm.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='tpm_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='tpm'/>
    </condition>
    <condition id='component.tpm_adapter.condition_id'>
      <require condition='allOf.driver.tpm, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.zephyr_headers.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.zephyr_headers.arch.condition_id'>
      <require condition='allOf.component.zephyr_headers, component.zephyr_headers.sys_until, component.zephyr_headers.toolchain, component.zephyr_headers.types, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.component.zephyr_headers, component.zephyr_headers.sys_until, component.zephyr_headers.toolchain, component.zephyr_headers.types, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_sys_until'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_toolchain'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_types'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.zephyr_headers.assert.condition_id'>
      <require condition='allOf.component.zephyr_headers, component.zephyr_headers.toolchain, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.component.zephyr_headers, component.zephyr_headers.toolchain, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_toolchain'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.zephyr_headers.atomic.condition_id'>
      <require condition='allOf.component.zephyr_headers, component.zephyr_headers.sys_until, component.zephyr_headers.toolchain, component.zephyr_headers.types, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.zephyr_headers.debug_coredump.condition_id'>
      <require condition='allOf.component.zephyr_headers, component.zephyr_headers.arch, component.zephyr_headers.sys_byteorder, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.component.zephyr_headers, component.zephyr_headers.arch, component.zephyr_headers.sys_byteorder, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_arch'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_sys_byteorder'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.zephyr_headers.device.condition_id'>
      <require condition='allOf.component.zephyr_headers, component.zephyr_headers.linkers, component.zephyr_headers.logging, component.zephyr_headers.sys_until, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.component.zephyr_headers, component.zephyr_headers.linkers, component.zephyr_headers.logging, component.zephyr_headers.sys_until, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_linkers'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_logging'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_sys_until'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.zephyr_headers.kernel.condition_id'>
      <require condition='allOf.component.zephyr_headers, component.zephyr_headers.arch, component.zephyr_headers.assert, component.zephyr_headers.atomic, component.zephyr_headers.linkers, component.zephyr_headers.sys_until, component.zephyr_headers.toolchain, component.zephyr_headers.types, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.component.zephyr_headers, component.zephyr_headers.arch, component.zephyr_headers.assert, component.zephyr_headers.atomic, component.zephyr_headers.linkers, component.zephyr_headers.sys_until, component.zephyr_headers.toolchain, component.zephyr_headers.types, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_arch'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_assert'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_atomic'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_linkers'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_sys_until'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_toolchain'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_types'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
