vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW716C_DFP.pdsc
    <condition id='component.zephyr_headers.linkers.condition_id'>
      <require condition='allOf.component.zephyr_headers, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.zephyr_headers.logging.condition_id'>
      <require condition='allOf.component.zephyr_headers, component.zephyr_headers.assert, component.zephyr_headers.atomic, component.zephyr_headers.sys_until, component.zephyr_headers.toolchain, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.component.zephyr_headers, component.zephyr_headers.assert, component.zephyr_headers.atomic, component.zephyr_headers.sys_until, component.zephyr_headers.toolchain, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_assert'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_atomic'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_sys_until'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_toolchain'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.zephyr_headers.storage_flash_map.condition_id'>
      <require condition='allOf.component.zephyr_headers, component.zephyr_headers.device, component.zephyr_headers.types, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.component.zephyr_headers, component.zephyr_headers.device, component.zephyr_headers.types, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_device'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_types'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.zephyr_headers.storage_stream_flash.condition_id'>
      <require condition='allOf.component.zephyr_headers, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.zephyr_headers.sys_byteorder.condition_id'>
      <require condition='allOf.component.zephyr_headers, component.zephyr_headers.assert, component.zephyr_headers.types, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.component.zephyr_headers, component.zephyr_headers.assert, component.zephyr_headers.types, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_assert'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_types'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.zephyr_headers.sys_until.condition_id'>
      <require condition='allOf.component.zephyr_headers, component.zephyr_headers.assert, component.zephyr_headers.types, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.zephyr_headers.toolchain.condition_id'>
      <require condition='allOf.component.zephyr_headers, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='component.zephyr_headers.types.condition_id'>
      <require condition='allOf.component.zephyr_headers, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='device.CMSIS.condition_id'>
      <require condition='allOf.CMSIS_Include_core_cm, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.CMSIS_Include_core_cm, device=MCXW716C.internal_condition'>
      <require Cclass='CMSIS' Cgroup='CORE'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='device.RTE.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='device.linker.condition_id'>
      <require condition='allOf.device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='allOf.device_id=MCXW716CxxxA.internal_condition'>
      <require condition='device_id.MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='device_ids.MCXW716CxxxA.internal_condition'>
      <accept Dname='MCXW716CMFPA' Dvendor='NXP:11'/>
      <accept Dname='MCXW716CMFTA' Dvendor='NXP:11'/>
    </condition>
    <condition id='allOf.toolchains=mdk, device_ids=MCXW716CxxxA.condition_id'>
      <require condition='toolchains.mdk.internal_condition'/>
      <require condition='device_ids.MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='toolchains.mdk.internal_condition'>
      <accept Tcompiler='ARMCC'/>
    </condition>
    <condition id='allOf.toolchains=armgcc, device_ids=MCXW716CxxxA.condition_id'>
      <require condition='toolchains.armgcc.internal_condition'/>
      <require condition='device_ids.MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='toolchains.armgcc.internal_condition'>
      <accept Tcompiler='GCC'/>
    </condition>
    <condition id='allOf.toolchains=iar, device_ids=MCXW716CxxxA.condition_id'>
      <require condition='toolchains.iar.internal_condition'/>
      <require condition='device_ids.MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='toolchains.iar.internal_condition'>
      <accept Tcompiler='IAR'/>
    </condition>
    <condition id='device.project_template.condition_id'>
      <require condition='allOf.driver.lpuart, component.lpuart_adapter, driver.clock, device_id=MCXW716CxxxA, device.startup, driver.common, driver.ccm32k, driver.port, driver.gpio, driver.spc, anyOf=allOf=component.serial_manager, component.serial_manager_uart, utility.debug_console, utility.debug_console_template_config, utility.assert, allOf=utility.debug_console_lite, utility.assert_lite.internal_condition'/>
    </condition>
    <condition id='allOf.driver.lpuart, component.lpuart_adapter, driver.clock, device_id=MCXW716CxxxA, device.startup, driver.common, driver.ccm32k, driver.port, driver.gpio, driver.spc, anyOf=allOf=component.serial_manager, component.serial_manager_uart, utility.debug_console, utility.debug_console_template_config, utility.assert, allOf=utility.debug_console_lite, utility.assert_lite.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='clock'/>
      <require condition='device_id.MCXW716CxxxA.internal_condition'/>
      <require Cclass='Device' Cgroup='Startup' Csub=''/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='ccm32k'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='port'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpio'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='spc'/>
      <require condition='anyOf.allOf=component.serial_manager, component.serial_manager_uart, utility.debug_console, utility.debug_console_template_config, utility.assert, allOf=utility.debug_console_lite, utility.assert_lite.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=component.serial_manager, component.serial_manager_uart, utility.debug_console, utility.debug_console_template_config, utility.assert, allOf=utility.debug_console_lite, utility.assert_lite.internal_condition'>
      <accept condition='allOf.component.serial_manager, component.serial_manager_uart, utility.debug_console, utility.debug_console_template_config, utility.assert.internal_condition'/>
      <accept condition='allOf.utility.debug_console_lite, utility.assert_lite.internal_condition'/>
    </condition>
    <condition id='allOf.component.serial_manager, component.serial_manager_uart, utility.debug_console, utility.debug_console_template_config, utility.assert.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_uart'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug console template config'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='assert'/>
    </condition>
    <condition id='allOf.utility.debug_console_lite, utility.assert_lite.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console_lite'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='assert_lite'/>
    </condition>
    <condition id='device.startup.condition_id'>
      <require condition='allOf.device.system, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.device.system, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='CMSIS' Csub='MCXW716C_system'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=iar.condition_id'>
      <require condition='toolchains.iar.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=armgcc.condition_id'>
      <require condition='toolchains.armgcc.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=mdk.condition_id'>
      <require condition='toolchains.mdk.internal_condition'/>
    </condition>
    <condition id='device.system.condition_id'>
      <require condition='allOf.device.CMSIS, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.device.CMSIS, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='CMSIS' Csub='MCXW716C_header'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='device.utility.condition_id'>
      <require condition='allOf.driver.lpadc, driver.vref_1, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.driver.lpadc, driver.vref_1, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpadc'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='vref'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='driver.cache_lpcac.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.ccm32k.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.clock.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='driver.cmc.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
