vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW716C_DFP.pdsc
    <condition id='anyOf.driver.dma3.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='dma'/>
    </condition>
    <condition id='driver.flexio.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.flexio_i2c_master.condition_id'>
      <require condition='allOf.driver.flexio, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='allOf.driver.flexio, device_id=MCXW716CxxxA.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexio'/>
      <require condition='device_id.MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.flexio_spi.condition_id'>
      <require condition='allOf.driver.flexio, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.flexio_spi_edma.condition_id'>
      <require condition='allOf.anyOf=driver.dma3, driver.flexio_spi, driver.dma3, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.dma3, driver.flexio_spi, driver.dma3, device=MCXW716C.internal_condition'>
      <require condition='anyOf.driver.dma3.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_spi'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dma'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='driver.flexio_uart.condition_id'>
      <require condition='allOf.driver.flexio, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.flexio_uart_edma.condition_id'>
      <require condition='allOf.anyOf=driver.dma3, driver.flexio_uart, driver.dma3, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.dma3, driver.flexio_uart, driver.dma3, device=MCXW716C.internal_condition'>
      <require condition='anyOf.driver.dma3.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_uart'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dma'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='driver.gpio.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.i3c.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.imu.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.lpadc.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.lpcmp.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.lpi2c.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.lpi2c_edma.condition_id'>
      <require condition='allOf.anyOf=driver.dma3, driver.lpi2c, driver.dma3, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.dma3, driver.lpi2c, driver.dma3, device=MCXW716C.internal_condition'>
      <require condition='anyOf.driver.dma3.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i2c'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dma'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='driver.lpit.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.lpspi.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.lpspi_edma.condition_id'>
      <require condition='allOf.anyOf=driver.dma3, driver.lpspi, driver.dma3, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.dma3, driver.lpspi, driver.dma3, device=MCXW716C.internal_condition'>
      <require condition='anyOf.driver.dma3.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpspi'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dma'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='driver.lptmr.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.lpuart.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.lpuart_edma.condition_id'>
      <require condition='allOf.anyOf=driver.dma3, driver.lpuart, driver.dma3, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.dma3, driver.lpuart, driver.dma3, device=MCXW716C.internal_condition'>
      <require condition='anyOf.driver.dma3.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dma'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='driver.ltc.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.ltc_dpa.condition_id'>
      <require condition='allOf.driver.ltc, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='allOf.driver.ltc, device_id=MCXW716CxxxA.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='ltc'/>
      <require condition='device_id.MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.mcm.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.mscm.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.port.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.romapi_soc.condition_id'>
      <require condition='allOf.driver.common, device=MCXW716C.internal_condition'/>
    </condition>
