vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW716C_DFP.pdsc
    <condition id='driver.rtc.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.rtt.condition_id'>
      <require condition='allOf.driver.rtt.template, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.driver.rtt.template, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='rtt template'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='driver.rtt.template.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='driver.sema42.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.sfa.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.smartcard_phy_gpio.condition_id'>
      <require condition='allOf.driver.common, driver.smartcard_uart, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, driver.smartcard_uart, device_id=MCXW716CxxxA.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='smartcard_uart'/>
      <require condition='device_id.MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.smartcard_phy_tda8035.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.smartcard_uart.condition_id'>
      <require condition='allOf.driver.common, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='driver.smscm.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.spc.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.syspm.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.tpm.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.trdc.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.trgmux.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.tstmr.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.vbat.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.vref_1.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.wdog32.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='driver.wuu.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXW716CxxxA.internal_condition'/>
    </condition>
    <condition id='utilities.misc_utilities.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=armgcc, mdk, cores=cm33.condition_id'>
      <require condition='toolchains.armgcc, mdk.internal_condition'/>
      <require condition='cores.cm33.internal_condition'/>
    </condition>
    <condition id='toolchains.armgcc, mdk.internal_condition'>
      <accept Tcompiler='GCC'/>
      <accept Tcompiler='ARMCC'/>
    </condition>
    <condition id='utilities.unity.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='utility.assert.condition_id'>
      <require condition='allOf.driver.common, utility.debug_console, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, utility.debug_console, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='utility.assert_lite.condition_id'>
      <require condition='allOf.driver.common, not=utility.assert, utility.debug_console_lite, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, not=utility.assert, utility.debug_console_lite, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='not.utility.assert.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console_lite'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='not.utility.assert.internal_condition'>
      <deny Cclass='Device' Cgroup='SDK Utilities' Csub='assert'/>
    </condition>
    <condition id='utility.debug_console.condition_id'>
      <require condition='allOf.component.serial_manager, driver.common, utility.str, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.component.serial_manager, driver.common, utility.str, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='str'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='utility.debug_console_lite.condition_id'>
      <require condition='allOf.component.lpuart_adapter, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='utility.debug_console_template_config.condition_id'>
      <require condition='allOf.utility.debug_console, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.utility.debug_console, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
    <condition id='utility.format.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='utility.incbin.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=armgcc, mdk.condition_id'>
      <require condition='toolchains.armgcc, mdk.internal_condition'/>
    </condition>
    <condition id='utility.notifier.condition_id'>
      <require condition='allOf.device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='utility.shell.condition_id'>
      <require condition='allOf.component.lists, driver.common, utility.str, device=MCXW716C.internal_condition'/>
    </condition>
    <condition id='allOf.component.lists, driver.common, utility.str, device=MCXW716C.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lists'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='str'/>
      <require condition='device.MCXW716C.internal_condition'/>
    </condition>
