vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW716C_DFP.pdsc
    <condition id='utility.str.condition_id'>
      <require condition='allOf.driver.common, device=MCXW716C.internal_condition'/>
    </condition>
  </conditions>
  <components>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='cmake_toolchain' Cversion='1.0.0' condition='cmake_toolchain.condition_id'>
      <description>Cmake_toolchain</description>
      <files>
        <file category='other' name='tools/cmake_toolchain_files/armgcc.cmake' projectpath='cmake_toolchain_files'/>
        <file category='other' name='tools/cmake_toolchain_files/xcc.cmake' projectpath='cmake_toolchain_files'/>
        <file category='other' name='tools/cmake_toolchain_files/xclang.cmake' projectpath='cmake_toolchain_files'/>
        <file category='other' name='tools/cmake_toolchain_files/armgcc_force_cpp.cmake' projectpath='cmake_toolchain_files'/>
        <file category='other' name='tools/cmake_toolchain_files/mcux_config.cmake' projectpath='cmake_toolchain_files'/>
        <file category='other' name='tools/cmake_toolchain_files/riscvllvm.cmake' projectpath='cmake_toolchain_files'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='one_i2c_mux_device_enabled' Cversion='1.0.0' condition='component.at_least_one_i2c_mux_device_enabled.condition_id'>
      <description>Component at_least_one_i2c_mux_device_enabled</description>
      <files>
        <file category='doc' name='components/i2c/muxes/component.at_least_one_i2c_mux_device_enabled_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='button' Cversion='1.0.0' condition='component.button.condition_id'>
      <description>Component button</description>
      <files>
        <file category='header' name='components/button/fsl_component_button.h' projectpath='component/button'/>
        <file category='sourceC' name='components/button/fsl_component_button.c' projectpath='component/button'/>
        <file category='include' name='components/button/'/>
      </files>
    </component>
    <component Cclass='Board Support' Cgroup='SDK Project Template' Csub='cmsis_drivers' Cversion='2.0.0' condition='component.cmsis_drivers.condition_id'>
      <description>CMSIS driver</description>
      <files>
        <file category='doc' name='components/cmsis_drivers/component.cmsis_drivers_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='crc_adapter' Cversion='1.0.0' condition='component.crc_adapter.condition_id'>
      <description>Component crc_adapter</description>
      <files>
        <file category='header' name='components/crc/fsl_adapter_crc.h' projectpath='component/crc'/>
        <file category='sourceC' name='components/crc/fsl_adapter_crc.c' projectpath='component/crc'/>
        <file category='include' name='components/crc/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='debug_coredump' Cversion='1.0.0' condition='component.debug_coredump.condition_id'>
      <description>Component debug coredump</description>
      <files>
        <file category='doc' name='components/debug/coredump/component.debug_coredump_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='debug_coredump_flash_backend' Cversion='1.0.0' condition='component.debug_coredump_backend.flash_partition.condition_id'>
      <description>Component debug coredump flash backend</description>
      <files>
        <file category='sourceC' name='components/debug/coredump/coredump_core.c' projectpath='component/debug/coredump'/>
        <file category='sourceC' name='components/debug/coredump/coredump_memory_regions.c' projectpath='component/debug/coredump'/>
        <file category='sourceC' name='components/debug/coredump/coredump_backend_flash_partition.c' projectpath='component/debug/coredump'/>
        <file category='sourceC' name='components/debug/coredump/coredump.c' projectpath='component/debug/coredump'/>
        <file category='sourceC' name='components/debug/coredump/error_stack_frame.c' projectpath='component/debug/coredump'/>
        <file category='header' name='components/debug/coredump/coredump_internal.h' projectpath='component/debug/coredump'/>
        <file category='include' name='components/debug/coredump/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='debug_coredump_mflash_backend' Cversion='1.0.0' condition='component.debug_coredump_backend.mflash.condition_id'>
      <description>Component debug coredump mflash backend</description>
      <files>
        <file category='sourceC' name='components/debug/coredump/coredump_core.c' projectpath='component/debug/coredump'/>
        <file category='sourceC' name='components/debug/coredump/coredump_memory_regions.c' projectpath='component/debug/coredump'/>
        <file category='sourceC' name='components/debug/coredump/coredump_backend_mflash.c' projectpath='component/debug/coredump'/>
        <file category='sourceC' name='components/debug/coredump/coredump.c' projectpath='component/debug/coredump'/>
        <file category='sourceC' name='components/debug/coredump/error_stack_frame.c' projectpath='component/debug/coredump'/>
        <file category='header' name='components/debug/coredump/coredump_internal.h' projectpath='component/debug/coredump'/>
        <file category='include' name='components/debug/coredump/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='debug_thread_info' Cversion='1.0.0' condition='component.debug_thread_info.condition_id'>
      <description>Component debug coredump thread info</description>
      <files>
        <file category='sourceC' name='components/debug/coredump/thread_info.c' projectpath='component/debug/coredump'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='eeprom_emulation' Cversion='2.0.0' condition='component.eeprom_emulation.condition_id'>
      <description>EEPROM Emulation Driver</description>
      <files>
        <file category='header' name='components/eeprom_emulation/fsl_eeprom_emulation.h' projectpath='component/eeprom_emulation'/>
        <file category='sourceC' name='components/eeprom_emulation/fsl_eeprom_emulation.c' projectpath='component/eeprom_emulation'/>
        <file category='include' name='components/eeprom_emulation/'/>
      </files>
    </component>
