vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW716C_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='enable_pca9544' Cversion='1.0.0' condition='component.enable_pca9544.condition_id'>
      <description>Component enable_pca9544</description>
      <RTE_Components_h>
#ifndef MCUX_ENABLE_PCA9544
#define MCUX_ENABLE_PCA9544 
#endif
</RTE_Components_h>
      <files>
        <file category='doc' name='components/i2c/muxes/component.enable_pca9544_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='enable_pca9548' Cversion='1.0.0' condition='component.enable_pca9548.condition_id'>
      <description>Component enable_pca9548</description>
      <RTE_Components_h>
#ifndef MCUX_ENABLE_PCA9548
#define MCUX_ENABLE_PCA9548 
#endif
</RTE_Components_h>
      <files>
        <file category='doc' name='components/i2c/muxes/component.enable_pca9548_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flash_adapter' Cversion='1.0.0' condition='component.flash_adapter.condition_id'>
      <description>Component flash_adapter</description>
      <files>
        <file category='doc' name='components/internal_flash/component.flash_adapter_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flash_nor_lpspi' Cversion='1.0.0' condition='component.flash_nor_lpspi.condition_id'>
      <description>Component flash_nor_lpspi</description>
      <files>
        <file category='header' name='components/flash/nor/fsl_nor_flash.h' projectpath='nor_flash/nor'/>
        <file category='sourceC' name='components/flash/nor/lpspi/fsl_lpspi_nor_flash.c' projectpath='nor_flash/nor/lpspi'/>
        <file category='header' name='components/flash/nor/lpspi/fsl_lpspi_nor_flash.h' projectpath='nor_flash/nor/lpspi'/>
        <file category='sourceC' name='components/flash/nor/lpspi/fsl_lpspi_mem_adapter.c' projectpath='nor_flash/nor/lpspi'/>
        <file category='header' name='components/flash/nor/lpspi/fsl_lpspi_mem_adapter.h' projectpath='nor_flash/nor/lpspi'/>
        <file category='include' name='components/flash/nor/'/>
        <file category='include' name='components/flash/nor/lpspi/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='gen_hal' Cversion='1.0.0' condition='component.gen_hal.condition_id'>
      <description>Generic Hardware abstraction Layer</description>
      <files>
        <file category='sourceC' name='components/gen_hal/init.c' projectpath='component/gen_hal'/>
        <file category='sourceC' name='components/gen_hal/zephyr/kernel/device.c' projectpath='component/gen_hal/zephyr/kernel'/>
        <file category='sourceC' name='components/gen_hal/sdk_integ/zephyr_mcux_helper.c' projectpath='component/gen_hal/sdk_integ'/>
        <file category='sourceC' name='components/gen_hal/zephyr/misc/empty_file.c' projectpath='component/gen_hal/zephyr/misc'/>
        <file category='include' name='components/gen_hal/zephyr/include/'/>
        <file category='include' name='components/gen_hal/zephyr/misc/generated/'/>
        <file category='include' name='components/gen_hal/zephyr/misc/'/>
        <file category='include' name='components/gen_hal/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='hal_clock_control' Cversion='1.0.0' condition='component.gen_hal.clock_control.condition_id'>
      <description>Hal of clock control</description>
      <files>
        <file category='doc' name='components/gen_hal/zephyr/drivers/clock_control/component.gen_hal.clock_control_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='hal_clock_control_mcux_syscon' Cversion='1.0.0' condition='component.gen_hal.clock_control.mcux_syscon.condition_id'>
      <description>Hal of clock control</description>
      <files>
        <file category='sourceC' name='components/gen_hal/zephyr/drivers/clock_control/clock_control_mcux_syscon.c' projectpath='component/gen_hal/zephyr/drivers/clock_control'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/dt-bindings/clock/mcux_lpc_syscon_clock.h' projectpath='component/gen_hal/zephyr/include/zephyr/dt-bindings/clock'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='hal_flash' Cversion='1.0.0' condition='component.gen_hal.flash.condition_id'>
      <description>Hal of flash</description>
      <files>
        <file category='doc' name='components/gen_hal/zephyr/drivers/flash/component.gen_hal.flash_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='hal_memc' Cversion='1.0.0' condition='component.gen_hal.memc.condition_id'>
      <description>Hal of memc</description>
      <files>
        <file category='doc' name='components/gen_hal/zephyr/drivers/memc/component.gen_hal.memc_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='gen_hal_osa' Cversion='1.0.0' condition='component.gen_hal.osa.condition_id'>
      <description>OSA to support Zephyr Kernel related features</description>
      <files>
        <file category='sourceC' name='components/gen_hal/osa/thread/fsl_osa_thread.c' projectpath='component/gen_hal/osa/thread'/>
        <file category='header' name='components/gen_hal/osa/thread/fsl_osa_thread.h' projectpath='component/gen_hal/osa/thread'/>
        <file category='include' name='components/gen_hal/osa/thread/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='hal_pinctrl' Cversion='1.0.0' condition='component.gen_hal.pinctrl.condition_id'>
      <description>Hal of pinctrl</description>
      <files>
        <file category='doc' name='components/gen_hal/zephyr/drivers/pinctrl/component.gen_hal.pinctrl_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='gpio_adapter' Cversion='1.0.1' condition='component.gpio_adapter.condition_id'>
      <description>Component gpio_adapter</description>
      <files>
        <file category='header' name='components/gpio/fsl_adapter_gpio.h' projectpath='component/gpio'/>
        <file category='sourceC' name='components/gpio/fsl_adapter_gpio.c' projectpath='component/gpio'/>
        <file category='include' name='components/gpio/'/>
      </files>
    </component>
