vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW716C_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='timer_manager' Cversion='1.0.0' condition='component.timer_manager.condition_id'>
      <description>Component timer_manager</description>
      <files>
        <file category='header' name='components/timer_manager/fsl_component_timer_manager.h' projectpath='component/timer_manager'/>
        <file category='sourceC' name='components/timer_manager/fsl_component_timer_manager.c' projectpath='component/timer_manager'/>
        <file category='include' name='components/timer_manager/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='tpm_adapter' Cversion='1.0.0' condition='component.tpm_adapter.condition_id'>
      <description>Component tpm_adapter</description>
      <RTE_Components_h>
#ifndef TIMER_PORT_TYPE_TPM
#define TIMER_PORT_TYPE_TPM 1
#endif
</RTE_Components_h>
      <files>
        <file category='header' name='components/timer/fsl_adapter_timer.h' projectpath='component/timer'/>
        <file category='sourceC' name='components/timer/fsl_adapter_tpm.c' projectpath='component/timer'/>
        <file category='include' name='components/timer/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers' Cversion='1.0.0' condition='component.zephyr_headers.condition_id'>
      <description>Zephyr headers adapted to the SDK environment</description>
      <files>
        <file category='doc' name='components/gen_hal/component.zephyr_headers_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_arch' Cversion='1.0.0' condition='component.zephyr_headers.arch.condition_id'>
      <description>Zephyr headers adapted to the SDK environment</description>
      <files>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/cpu.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/arch_interface.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/irq_offload.h' projectpath='component/gen_hal/zephyr/include/zephyr'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/syscall.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/arm/syscall.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch/arm' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/timing/types.h' projectpath='component/gen_hal/zephyr/include/zephyr/timing' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/arch_inlines.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/arm/arch_inlines.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch/arm' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/arm/thread.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch/arm' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/arm/exception.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch/arm' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/arm/cortex_m/exception.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch/arm/cortex_m' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/arm/cortex_m/nvic.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch/arm/cortex_m' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/arm/irq.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch/arm' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sw_isr_table.h' projectpath='component/gen_hal/zephyr/include/zephyr'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/arm/error.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch/arm' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/arm/misc.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch/arm' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/arm/arch.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch/arm' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/common/sys_io.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch/common' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/common/addr_types.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch/common' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/common/ffs.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch/common' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/arm/nmi.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch/arm' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/arm/asm_inline.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch/arm' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/arm/asm_inline_gcc.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch/arm' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/common/sys_bitops.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch/common' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/arm/gdbstub.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch/arm' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/arm/cortex_m/cpu.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch/arm/cortex_m' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/arm/cortex_m/memory_map.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch/arm/cortex_m' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/fatal_types.h' projectpath='component/gen_hal/zephyr/include/zephyr'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/arm/mpu/arm_mpu.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch/arm/mpu' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/arm/mpu/arm_mpu_v7m.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch/arm/mpu' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/arm/mpu/arm_mpu_v8.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch/arm/mpu' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/arm/mpu/nxp_mpu.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch/arm/mpu' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/arm/mmu/arm_mmu.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch/arm/mmu' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/rb.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/alloca.h' projectpath='component/gen_hal/zephyr/include/zephyr'/>
        <file category='header' name='components/gen_hal/zephyr/misc/arch/arm/asm_inline_other.h' projectpath='component/gen_hal/zephyr/misc/arch/arm' path='components/gen_hal/zephyr/misc'/>
        <file category='header' name='components/gen_hal/zephyr/misc/cmsis_core.h' projectpath='component/gen_hal/zephyr/misc'/>
        <file category='include' name='components/gen_hal/zephyr/include/'/>
        <file category='include' name='components/gen_hal/zephyr/misc/generated/'/>
        <file category='include' name='components/gen_hal/zephyr/misc/'/>
        <file category='include' name='components/gen_hal/zephyr/include/zephyr/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_assert' Cversion='1.0.0' condition='component.zephyr_headers.assert.condition_id'>
      <description>Zephyr headers adapted to the SDK environment</description>
      <files>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/__assert.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='include' name='components/gen_hal/zephyr/include/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_atomic' Cversion='1.0.0' condition='component.zephyr_headers.atomic.condition_id'>
      <description>Zephyr headers adapted to the SDK environment</description>
      <files>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/atomic.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/atomic_types.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/atomic_builtin.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='include' name='components/gen_hal/zephyr/include/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_debug_coredump' Cversion='1.0.0' condition='component.zephyr_headers.debug_coredump.condition_id'>
      <description>Zephyr coredump headers adapted to the SDK environment</description>
      <files>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/debug/coredump.h' projectpath='component/gen_hal/zephyr/include/zephyr/debug' path='components/gen_hal/zephyr/include'/>
        <file category='include' name='components/gen_hal/zephyr/include/'/>
      </files>
    </component>
