vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW716C_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_device' Cversion='1.0.0' condition='component.zephyr_headers.device.condition_id'>
      <description>Zephyr headers adapted to the SDK environment</description>
      <files>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/device.h' projectpath='component/gen_hal/zephyr/include/zephyr' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/devicetree.h' projectpath='component/gen_hal/zephyr/include/zephyr' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/pm/state.h' projectpath='component/gen_hal/zephyr/include/zephyr/pm' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/pm/device.h' projectpath='component/gen_hal/zephyr/include/zephyr/pm' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/misc/generated/zephyr/syscalls/device.h' projectpath='component/gen_hal/zephyr/misc/generated/zephyr/syscalls' path='components/gen_hal/zephyr/misc/generated'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/init.h' projectpath='component/gen_hal/zephyr/include/zephyr' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/device_mmio.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/devicetree/clocks.h' projectpath='component/gen_hal/zephyr/include/zephyr/devicetree' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/devicetree/ordinals.h' projectpath='component/gen_hal/zephyr/include/zephyr/devicetree' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/devicetree/fixed-partitions.h' projectpath='component/gen_hal/zephyr/include/zephyr/devicetree' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/internal/syscall_handler.h' projectpath='component/gen_hal/zephyr/include/zephyr/internal' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/math_extras.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/math_extras_impl.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='include' name='components/gen_hal/zephyr/include/'/>
        <file category='include' name='components/gen_hal/zephyr/misc/generated/'/>
        <file category='include' name='components/gen_hal/zephyr/misc/'/>
        <file category='include' name='components/gen_hal/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_kernel' Cversion='1.0.0' condition='component.zephyr_headers.kernel.condition_id'>
      <description>Zephyr headers adapted to the SDK environment</description>
      <files>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/kernel.h' projectpath='component/gen_hal/zephyr/include/zephyr'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/kernel_includes.h' projectpath='component/gen_hal/zephyr/include/zephyr'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/dlist.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/slist.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/list_gen.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/sflist.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/kernel/obj_core.h' projectpath='component/gen_hal/zephyr/include/zephyr/kernel' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/kernel_structs.h' projectpath='component/gen_hal/zephyr/include/zephyr'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/sys_heap.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/structs.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/kernel/stats.h' projectpath='component/gen_hal/zephyr/include/zephyr/kernel' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/kernel_version.h' projectpath='component/gen_hal/zephyr/include/zephyr'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/syscall.h' projectpath='component/gen_hal/zephyr/include/zephyr'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/printk.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys_clock.h' projectpath='component/gen_hal/zephyr/include/zephyr'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/spinlock.h' projectpath='component/gen_hal/zephyr/include/zephyr'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/fatal.h' projectpath='component/gen_hal/zephyr/include/zephyr'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/fatal_types.h' projectpath='component/gen_hal/zephyr/include/zephyr'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/exception.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/irq.h' projectpath='component/gen_hal/zephyr/include/zephyr'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/kernel/thread_stack.h' projectpath='component/gen_hal/zephyr/include/zephyr/kernel' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/app_memory/mem_domain.h' projectpath='component/gen_hal/zephyr/include/zephyr/app_memory' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/kobject.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/iterable_sections.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/internal/kobject_internal.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys/internal' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/kernel/thread.h' projectpath='component/gen_hal/zephyr/include/zephyr/kernel' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/kernel/mm/demand_paging.h' projectpath='component/gen_hal/zephyr/include/zephyr/kernel/mm' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/kernel/mm.h' projectpath='component/gen_hal/zephyr/include/zephyr/kernel' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/kernel/internal/mm.h' projectpath='component/gen_hal/zephyr/include/zephyr/kernel/internal' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/mem_manage.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/kernel/internal/smp.h' projectpath='component/gen_hal/zephyr/include/zephyr/kernel/internal' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/tracing/tracing_macros.h' projectpath='component/gen_hal/zephyr/include/zephyr/tracing' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/mem_stats.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/tracing/tracing.h' projectpath='component/gen_hal/zephyr/include/zephyr/tracing' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/tracing/tracking.h' projectpath='component/gen_hal/zephyr/include/zephyr/tracing' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/arch/arm/structs.h' projectpath='component/gen_hal/zephyr/include/zephyr/arch/arm' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/misc/generated/zephyr/syscall_list.h' projectpath='component/gen_hal/zephyr/misc/generated/zephyr' path='components/gen_hal/zephyr/misc/generated'/>
        <file category='header' name='components/gen_hal/zephyr/misc/generated/zephyr/kobj-types-enum.h' projectpath='component/gen_hal/zephyr/misc/generated/zephyr' path='components/gen_hal/zephyr/misc/generated'/>
        <file category='header' name='components/gen_hal/zephyr/misc/generated/zephyr/syscalls/kobject.h' projectpath='component/gen_hal/zephyr/misc/generated/zephyr/syscalls' path='components/gen_hal/zephyr/misc/generated'/>
        <file category='header' name='components/gen_hal/zephyr/misc/generated/zephyr/syscalls/kernel.h' projectpath='component/gen_hal/zephyr/misc/generated/zephyr/syscalls' path='components/gen_hal/zephyr/misc/generated'/>
        <file category='header' name='components/gen_hal/zephyr/misc/generated/zephyr/syscalls/demand_paging.h' projectpath='component/gen_hal/zephyr/misc/generated/zephyr/syscalls' path='components/gen_hal/zephyr/misc/generated'/>
        <file category='include' name='components/gen_hal/zephyr/include/'/>
        <file category='include' name='components/gen_hal/zephyr/misc/generated/'/>
        <file category='include' name='components/gen_hal/zephyr/misc/'/>
        <file category='include' name='components/gen_hal/zephyr/include/zephyr/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_linkers' Cversion='1.0.0' condition='component.zephyr_headers.linkers.condition_id'>
      <description>Zephyr headers adapted to the SDK environment</description>
      <files>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/linker/sections.h' projectpath='component/gen_hal/zephyr/include/zephyr/linker' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/linker/section_tags.h' projectpath='component/gen_hal/zephyr/include/zephyr/linker' path='components/gen_hal/zephyr/include'/>
        <file category='include' name='components/gen_hal/zephyr/include/'/>
      </files>
    </component>
