vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW716C_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_logging' Cversion='1.0.0' condition='component.zephyr_headers.logging.condition_id'>
      <description>Zephyr headers adapted to the SDK environment</description>
      <files>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/logging/log.h' projectpath='component/gen_hal/zephyr/include/zephyr/logging' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/iterable_sections.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='include' name='components/gen_hal/zephyr/include/'/>
        <file category='include' name='components/gen_hal/zephyr/misc/generated/'/>
        <file category='include' name='components/gen_hal/zephyr/misc/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_storage_flash_map' Cversion='1.0.0' condition='component.zephyr_headers.storage_flash_map.condition_id'>
      <description>Zephyr flash_map headers adapted to the SDK environment</description>
      <files>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/storage/flash_map.h' projectpath='component/gen_hal/zephyr/include/zephyr/storage' path='components/gen_hal/zephyr/include'/>
        <file category='include' name='components/gen_hal/zephyr/include/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_stream_flash' Cversion='1.0.0' condition='component.zephyr_headers.storage_stream_flash.condition_id'>
      <description>Zephyr stream_flash headers adapted to the SDK environment</description>
      <files>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/storage/stream_flash.h' projectpath='component/gen_hal/zephyr/include/zephyr/storage' path='components/gen_hal/zephyr/include'/>
        <file category='include' name='components/gen_hal/zephyr/include/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_sys_byteorder' Cversion='1.0.0' condition='component.zephyr_headers.sys_byteorder.condition_id'>
      <description>Zephyr headers adapted to the SDK environment</description>
      <files>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/byteorder.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='include' name='components/gen_hal/zephyr/include/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_sys_until' Cversion='1.0.0' condition='component.zephyr_headers.sys_until.condition_id'>
      <description>Zephyr headers adapted to the SDK environment</description>
      <files>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/util.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/util_internal.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/util_internal_is_eq.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/util_internal_util_dec.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/util_internal_util_inc.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/util_internal_util_x2.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/util_listify.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/util_loops.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/util_macro.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/time_units.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/sys/sys_io.h' projectpath='component/gen_hal/zephyr/include/zephyr/sys' path='components/gen_hal/zephyr/include'/>
        <file category='include' name='components/gen_hal/zephyr/include/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_toolchain' Cversion='1.0.0' condition='component.zephyr_headers.toolchain.condition_id'>
      <description>Zephyr headers adapted to the SDK environment</description>
      <files>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/types.h' projectpath='component/gen_hal/zephyr/include/zephyr' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/toolchain/armclang.h' projectpath='component/gen_hal/zephyr/include/zephyr/toolchain' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/toolchain/common.h' projectpath='component/gen_hal/zephyr/include/zephyr/toolchain' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/toolchain/gcc.h' projectpath='component/gen_hal/zephyr/include/zephyr/toolchain' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/toolchain/iar.h' projectpath='component/gen_hal/zephyr/include/zephyr/toolchain' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/toolchain/llvm.h' projectpath='component/gen_hal/zephyr/include/zephyr/toolchain' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/toolchain/mwdt.h' projectpath='component/gen_hal/zephyr/include/zephyr/toolchain' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/toolchain/xcc.h' projectpath='component/gen_hal/zephyr/include/zephyr/toolchain' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/toolchain/xcc_missing_defs.h' projectpath='component/gen_hal/zephyr/include/zephyr/toolchain' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/toolchain/zephyr_stdint.h' projectpath='component/gen_hal/zephyr/include/zephyr/toolchain' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/toolchain.h' projectpath='component/gen_hal/zephyr/include/zephyr' path='components/gen_hal/zephyr/include'/>
        <file category='header' name='components/gen_hal/sdk_integ/errno.h' projectpath='component/gen_hal/sdk_integ' path='components/gen_hal'/>
        <file category='header' name='components/gen_hal/sdk_integ/zephyr_mcux_toolchain.h' projectpath='component/gen_hal/sdk_integ' path='components/gen_hal'/>
        <file category='include' name='components/gen_hal/zephyr/include/'/>
        <file category='include' name='components/gen_hal/zephyr/misc/generated/'/>
        <file category='include' name='components/gen_hal/zephyr/misc/'/>
        <file category='include' name='components/gen_hal/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='zephyr_headers_types' Cversion='1.0.0' condition='component.zephyr_headers.types.condition_id'>
      <description>Zephyr headers adapted to the SDK environment</description>
      <files>
        <file category='header' name='components/gen_hal/zephyr/include/zephyr/types.h' projectpath='component/gen_hal/zephyr/include/zephyr' path='components/gen_hal/zephyr/include'/>
        <file category='include' name='components/gen_hal/zephyr/include/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='CMSIS' Csub='MCXW716C_header' Cversion='1.0.0' condition='device.CMSIS.condition_id'>
      <description>Device MCXW716C_cmsis</description>
      <files>
        <file category='header' name='devices/MCXW716C/fsl_device_registers.h' projectpath='device'/>
        <file category='header' name='devices/MCXW716C/MCXW716C.h' projectpath='device'/>
        <file category='header' name='devices/MCXW716C/MCXW716C_features.h' projectpath='device'/>
        <file category='header' name='devices/MCXW716C/MCXW716C_COMMON.h' projectpath='device'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_ADC.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_ATX.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_AXBS.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_BLE2_REG.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_BRIC.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_BTRTU1.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_BTU2_REG.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_CAN.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_CCM32K.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_CIU2.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_CMC.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_CRC.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_DMA.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_DSB.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_ELEMU.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_EWM.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_FLEXIO.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_FMU.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_FRO192M.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_GEN4PHY.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_GENFSK.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_GPIO.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_I3C.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_LPCMP.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_LPI2C.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_LPIT.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_LPSPI.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_LPTMR.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_LPUART.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_LTC.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_MCM.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_MRCC.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_MSCM.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_NPX.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_PORT.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_RADIO_CTRL.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_RBME.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_REGFILE.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_RFMC.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_RF_CMC1.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_RF_FMCCFG.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_RTC.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_RX_PACKET_RAM.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_SCG.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_SEMA42.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_SFA.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_SMSCM.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_SPC.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_SYSPM.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_TPM.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_TRDC.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_TRGMUX.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_TSTMR.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_TX_PACKET_RAM.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_UART.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_UART_PFU.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_VBAT.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_VREF.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_WDOG.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_WOR.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_WUU.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_XCVR_ANALOG.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_XCVR_MISC.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_XCVR_PLL_DIG.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_XCVR_RX_DIG.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_XCVR_TSM.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_XCVR_TX_DIG.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_XCVR_ZBDEMOD.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXW716C/periph2/PERI_ZLL.h' projectpath='device/periph2'/>
        <file category='include' name='devices/MCXW716C/'/>
        <file category='include' name='devices/MCXW716C/periph2/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Project Template' Csub='RTE_Device' Cversion='1.0.0' condition='device.RTE.condition_id'>
      <description>Rte_device</description>
      <files>
        <file category='header' attr='config' name='devices/MCXW716C/template/RTE_Device.h' version='1.0.0' projectpath='board'/>
        <file category='include' name='devices/MCXW716C/template/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='MCXW716C_linker' Cversion='1.0.0' condition='device.linker.condition_id'>
      <description>Device MCXW716C_linker</description>
      <files>
        <file condition='allOf.toolchains=mdk, device_ids=MCXW716CxxxA.condition_id' category='linkerScript' attr='config' name='devices/MCXW716C/arm/mcxw716_flash.scf' version='1.0.0' projectpath='MCXW716C/arm'/>
        <file condition='allOf.toolchains=mdk, device_ids=MCXW716CxxxA.condition_id' category='linkerScript' attr='config' name='devices/MCXW716C/arm/mcxw716_ram.scf' version='1.0.0' projectpath='MCXW716C/arm'/>
        <file condition='allOf.toolchains=armgcc, device_ids=MCXW716CxxxA.condition_id' category='linkerScript' attr='config' name='devices/MCXW716C/gcc/mcxw716_flash.ld' version='1.0.0' projectpath='MCXW716C/gcc'/>
        <file condition='allOf.toolchains=armgcc, device_ids=MCXW716CxxxA.condition_id' category='linkerScript' attr='config' name='devices/MCXW716C/gcc/mcxw716_ram.ld' version='1.0.0' projectpath='MCXW716C/gcc'/>
        <file condition='allOf.toolchains=iar, device_ids=MCXW716CxxxA.condition_id' category='linkerScript' attr='config' name='devices/MCXW716C/iar/mcxw716_flash.icf' version='1.0.0' projectpath='MCXW716C/iar'/>
        <file condition='allOf.toolchains=iar, device_ids=MCXW716CxxxA.condition_id' category='linkerScript' attr='config' name='devices/MCXW716C/iar/mcxw716_ram.icf' version='1.0.0' projectpath='MCXW716C/iar'/>
      </files>
    </component>
    <component Cclass='Board Support' Cgroup='SDK Project Template' Csub='project_template' Cvariant='MCXW716C' Cversion='1.0.0' condition='device.project_template.condition_id' isDefaultVariant='1'>
      <description>Devices_project_template MCXW716C</description>
      <files>
        <file category='header' attr='config' name='devices/MCXW716C/project_template/board.h' version='1.0.0' projectpath='board'/>
        <file category='sourceC' attr='config' name='devices/MCXW716C/project_template/board.c' version='1.0.0' projectpath='board'/>
        <file category='header' attr='config' name='devices/MCXW716C/project_template/clock_config.h' version='1.0.0' projectpath='board'/>
        <file category='sourceC' attr='config' name='devices/MCXW716C/project_template/clock_config.c' version='1.0.0' projectpath='board'/>
        <file category='header' attr='config' name='devices/MCXW716C/project_template/pin_mux.h' version='1.0.0' projectpath='board'/>
        <file category='sourceC' attr='config' name='devices/MCXW716C/project_template/pin_mux.c' version='1.0.0' projectpath='board'/>
        <file category='header' attr='config' name='devices/MCXW716C/project_template/peripherals.h' version='1.0.0' projectpath='board'/>
        <file category='sourceC' attr='config' name='devices/MCXW716C/project_template/peripherals.c' version='1.0.0' projectpath='board'/>
        <file category='include' name='devices/MCXW716C/project_template/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='Startup' Csub='' Cversion='1.0.0' condition='device.startup.condition_id'>
      <description>Device MCXW716C_startup</description>
      <files>
        <file condition='allOf.toolchains=iar.condition_id' category='sourceAsm' attr='config' name='devices/MCXW716C/iar/startup_MCXW716C.s' version='1.0.0' projectpath='startup/iar'/>
        <file condition='allOf.toolchains=armgcc.condition_id' category='sourceAsm' attr='config' name='devices/MCXW716C/gcc/startup_MCXW716C.S' version='1.0.0' projectpath='startup/gcc'/>
        <file condition='allOf.toolchains=mdk.condition_id' category='sourceAsm' attr='config' name='devices/MCXW716C/arm/startup_MCXW716C.S' version='1.0.0' projectpath='startup/arm'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='CMSIS' Csub='MCXW716C_system' Cversion='1.0.0' condition='device.system.condition_id'>
      <description>Device MCXW716C_system</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/system_MCXW716C.c' projectpath='device'/>
        <file category='header' name='devices/MCXW716C/system_MCXW716C.h' projectpath='device'/>
        <file category='include' name='devices/MCXW716C/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='utility' Cversion='1.0.0' condition='device.utility.condition_id'>
      <description>utilitiy for MCXW716C</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/utility/board_utility.c' projectpath='board'/>
        <file category='header' name='devices/MCXW716C/utility/board_utility.h' projectpath='board'/>
        <file category='include' name='devices/MCXW716C/utility/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='cache_lpcac' Cversion='2.1.1' condition='driver.cache_lpcac.condition_id'>
      <description>CACHE Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_cache.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_cache.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='ccm32k' Cversion='2.2.0' condition='driver.ccm32k.condition_id'>
      <description>CCM32K Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_ccm32k.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_ccm32k.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
