vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW716C_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='clock' Cversion='2.2.1' condition='driver.clock.condition_id'>
      <description>Clock Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_clock.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_clock.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='cmc' Cversion='2.4.1' condition='driver.cmc.condition_id'>
      <description>CMC Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_cmc.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_cmc.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='CMSIS Driver' Cgroup='GPIO' Csub='gpio_cmsis' Cversion='1.0.0' Capiversion='2.0.0' condition='driver.cmsis_gpio.condition_id'>
      <description>GPIO CMSIS Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/cmsis_drivers/fsl_gpio_cmsis.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/cmsis_drivers/fsl_gpio_cmsis.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/cmsis_drivers/'/>
      </files>
    </component>
    <component Cclass='CMSIS Driver' Cgroup='I2C' Csub='lpi2c_cmsis' Cversion='1.0.0' Capiversion='2.3.0' condition='driver.cmsis_lpi2c.condition_id'>
      <description>LPI2C CMSIS Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/cmsis_drivers/fsl_lpi2c_cmsis.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/cmsis_drivers/fsl_lpi2c_cmsis.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/cmsis_drivers/'/>
      </files>
    </component>
    <component Cclass='CMSIS Driver' Cgroup='SPI' Csub='lpspi_cmsis' Cversion='1.0.0' Capiversion='2.2.0' condition='driver.cmsis_lpspi.condition_id'>
      <description>LPSPI CMSIS Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/cmsis_drivers/fsl_lpspi_cmsis.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/cmsis_drivers/fsl_lpspi_cmsis.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/cmsis_drivers/'/>
      </files>
    </component>
    <component Cclass='CMSIS Driver' Cgroup='USART' Csub='lpuart_cmsis' Cversion='1.0.0' Capiversion='2.3.0' condition='driver.cmsis_lpuart.condition_id'>
      <description>LPUART CMSIS Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/cmsis_drivers/fsl_lpuart_cmsis.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/cmsis_drivers/fsl_lpuart_cmsis.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/cmsis_drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='common' Cversion='2.5.0' condition='driver.common.condition_id'>
      <description>common Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_common.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_common.c' projectpath='drivers'/>
        <file condition='allOf.cores=cm33.condition_id' category='sourceC' name='devices/MCXW716C/drivers/fsl_common_arm.c' projectpath='drivers'/>
        <file condition='allOf.cores=cm33.condition_id' category='header' name='devices/MCXW716C/drivers/fsl_common_arm.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='crc' Cversion='2.0.4' condition='driver.crc.condition_id'>
      <description>CRC Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_crc.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_crc.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='dma' Cversion='2.3.2' condition='driver.dma3.condition_id'>
      <description>EDMA Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_edma.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_edma.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='elemu' Cversion='2.1.1' condition='driver.elemu.condition_id'>
      <description>ELE MU Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_elemu.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_elemu.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='ewm' Cversion='2.0.3' condition='driver.ewm.condition_id'>
      <description>EWM Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_ewm.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_ewm.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flash_k4' Cversion='2.1.2' condition='driver.flash_k4.condition_id'>
      <description>flash_k4 Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_flash.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_k4_flash.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_k4_flash.h' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_flash_utilities.h' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_flash_adapter.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_k4_controller.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_k4_controller.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexcan' Cversion='2.13.1' condition='driver.flexcan.condition_id'>
      <description>FLEXCAN Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_flexcan.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_flexcan.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexcan_edma' Cversion='2.11.7' condition='driver.flexcan_edma.condition_id'>
      <description>FLEXCAN Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_flexcan_edma.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_flexcan_edma.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexio' Cversion='2.3.0' condition='driver.flexio.condition_id'>
      <description>FLEXIO Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_flexio.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_flexio.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_i2c_master' Cversion='2.5.1' condition='driver.flexio_i2c_master.condition_id'>
      <description>FLEXIO I2C Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_flexio_i2c_master.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_flexio_i2c_master.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_spi' Cversion='2.3.5' condition='driver.flexio_spi.condition_id'>
      <description>FLEXIO SPI Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_flexio_spi.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_flexio_spi.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_spi_edma' Cversion='2.3.0' condition='driver.flexio_spi_edma.condition_id'>
      <description>FLEXIO SPI EDMA Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_flexio_spi_edma.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_flexio_spi_edma.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_uart' Cversion='2.5.1' condition='driver.flexio_uart.condition_id'>
      <description>FLEXIO UART Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_flexio_uart.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_flexio_uart.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_uart_edma' Cversion='2.4.1' condition='driver.flexio_uart_edma.condition_id'>
      <description>FLEXIO UART EDMA Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_flexio_uart_edma.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_flexio_uart_edma.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='gpio' Cversion='2.8.1' condition='driver.gpio.condition_id'>
      <description>GPIO Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_gpio.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_gpio.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='i3c' Cversion='2.13.1' condition='driver.i3c.condition_id'>
      <description>I3C Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_i3c.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_i3c.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='imu' Cversion='2.1.1' condition='driver.imu.condition_id'>
      <description>IMU Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_imu.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_imu.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lpadc' Cversion='2.9.1' condition='driver.lpadc.condition_id'>
      <description>LPADC Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_lpadc.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_lpadc.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lpcmp' Cversion='2.3.1' condition='driver.lpcmp.condition_id'>
      <description>LPCMP Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_lpcmp.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_lpcmp.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
