vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW716C_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='i2c' Cversion='2.5.7' condition='driver.lpi2c.condition_id'>
      <description>LPI2C Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_lpi2c.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_lpi2c.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='i2c_edma' Cversion='2.4.2' condition='driver.lpi2c_edma.condition_id'>
      <description>LPI2C Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_lpi2c_edma.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_lpi2c_edma.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lpit' Cversion='2.1.1' condition='driver.lpit.condition_id'>
      <description>LPIT Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_lpit.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_lpit.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lpspi' Cversion='2.6.10' condition='driver.lpspi.condition_id'>
      <description>LPSPI Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_lpspi.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_lpspi.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lpspi_edma' Cversion='2.4.6' condition='driver.lpspi_edma.condition_id'>
      <description>LPSPI Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_lpspi_edma.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_lpspi_edma.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lptmr' Cversion='2.2.0' condition='driver.lptmr.condition_id'>
      <description>LPTMR Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_lptmr.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_lptmr.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart' Cversion='2.9.0' condition='driver.lpuart.condition_id'>
      <description>LPUART Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_lpuart.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_lpuart.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart_edma' Cversion='2.6.0' condition='driver.lpuart_edma.condition_id'>
      <description>LPUART Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_lpuart_edma.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_lpuart_edma.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='ltc' Cversion='2.0.17' condition='driver.ltc.condition_id'>
      <description>LTC Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_ltc.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_ltc.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='ltc_dpa' Cversion='2.0.8' condition='driver.ltc_dpa.condition_id'>
      <description>LTC Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_ltc_dpa.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='mcm' Cversion='2.2.0' condition='driver.mcm.condition_id'>
      <description>MCM Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_mcm.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='mscm' Cversion='2.0.0' condition='driver.mscm.condition_id'>
      <description>MSCM Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_mscm.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='port' Cversion='2.5.1' condition='driver.port.condition_id'>
      <description>PORT Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_port.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
