vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW716C_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='romapi' Cversion='1.2.0' condition='driver.romapi_soc.condition_id'>
      <description>ROMAPI Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_flash_api.h' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_kb_api.h' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_lpspi_flash.h' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_nboot.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_romapi.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='rtc' Cversion='2.3.0' condition='driver.rtc.condition_id'>
      <description>RTC Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_rtc.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_rtc.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='rtt' Cversion='7.22.0' condition='driver.rtt.condition_id'>
      <description>SEGGER Real Time Transfer(RTT)</description>
      <files>
        <file category='doc' name='components/rtt/License.txt' projectpath='rtt'/>
        <file category='doc' name='components/rtt/README.txt' projectpath='rtt'/>
        <file category='sourceC' name='components/rtt/RTT/SEGGER_RTT.c' projectpath='rtt/RTT'/>
        <file category='header' name='components/rtt/RTT/SEGGER_RTT.h' projectpath='rtt/RTT'/>
        <file category='sourceAsm' name='components/rtt/RTT/SEGGER_RTT_ASM_ARMv7M.S' projectpath='rtt/RTT'/>
        <file category='sourceC' name='components/rtt/RTT/SEGGER_RTT_printf.c' projectpath='rtt/RTT'/>
        <file category='sourceC' name='components/rtt/Syscalls/SEGGER_RTT_Syscalls_GCC.c' projectpath='rtt/Syscalls'/>
        <file category='sourceC' name='components/rtt/Syscalls/SEGGER_RTT_Syscalls_IAR.c' projectpath='rtt/Syscalls'/>
        <file category='sourceC' name='components/rtt/Syscalls/SEGGER_RTT_Syscalls_KEIL.c' projectpath='rtt/Syscalls'/>
        <file category='sourceC' name='components/rtt/Syscalls/SEGGER_RTT_Syscalls_SES.c' projectpath='rtt/Syscalls'/>
        <file category='doc' name='components/rtt/License.txt' projectpath='rtt'/>
        <file category='doc' name='components/rtt/README.txt' projectpath='rtt'/>
        <file category='include' name='components/rtt/RTT/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='rtt template' Cversion='7.22.0' condition='driver.rtt.template.condition_id'>
      <description>RTT template configuration</description>
      <files>
        <file category='header' attr='config' name='components/rtt/template/SEGGER_RTT_Conf.h' version='7.22.0' projectpath='rtt/template'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='sema42' Cversion='2.0.4' condition='driver.sema42.condition_id'>
      <description>SEMA42 Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_sema42.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_sema42.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='sfa' Cversion='2.1.2' condition='driver.sfa.condition_id'>
      <description>SFA Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_sfa.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_sfa.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='smartcard_phy_gpio' Cversion='2.3.0' condition='driver.smartcard_phy_gpio.condition_id'>
      <description>SMARTCARD PHY GPIO, use only one SMARTCARD PHY in the project</description>
      <RTE_Components_h>
#ifndef USING_PHY_GPIO
#define USING_PHY_GPIO 
#endif
</RTE_Components_h>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_smartcard_phy.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_smartcard_phy_gpio.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='smartcard_phy_tda8035' Cversion='2.3.0' condition='driver.smartcard_phy_tda8035.condition_id'>
      <description>SMARTCARD PHY TDA8035, use only one SMARTCARD PHY in the project</description>
      <RTE_Components_h>
#ifndef USING_PHY_TDA8035
#define USING_PHY_TDA8035 
#endif
</RTE_Components_h>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_smartcard_phy.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_smartcard_phy_tda8035.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='smartcard_uart' Cversion='2.3.0' condition='driver.smartcard_uart.condition_id'>
      <description>SMARTCARD UART Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_smartcard.h' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_smartcard_uart.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_smartcard_uart.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
