vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW716C_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='smscm' Cversion='2.0.0' condition='driver.smscm.condition_id'>
      <description>SMSCM Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_smscm.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_smscm.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='spc' Cversion='2.5.0' condition='driver.spc.condition_id'>
      <description>SPC Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_spc.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_spc.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='syspm' Cversion='2.3.0' condition='driver.syspm.condition_id'>
      <description>SYSPM Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_syspm.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_syspm.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='tpm' Cversion='2.3.3' condition='driver.tpm.condition_id'>
      <description>TPM Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_tpm.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_tpm.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='trdc' Cversion='2.3.0' condition='driver.trdc.condition_id'>
      <description>TRDC Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_trdc.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_trdc.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='trgmux' Cversion='2.0.1' condition='driver.trgmux.condition_id'>
      <description>TRGMUX Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_trgmux.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_trgmux.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='tstmr' Cversion='2.0.2' condition='driver.tstmr.condition_id'>
      <description>TSTMR Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_tstmr.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='vbat' Cversion='2.1.0' condition='driver.vbat.condition_id'>
      <description>VBAT Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_vbat.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_vbat.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='vref' Cversion='2.4.0' condition='driver.vref_1.condition_id'>
      <description>VREF Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_vref.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_vref.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wdog' Cversion='2.1.0' condition='driver.wdog32.condition_id'>
      <description>WDOG32 Driver</description>
      <files>
        <file category='header' name='devices/MCXW716C/drivers/fsl_wdog32.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_wdog32.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wuu' Cversion='2.4.0' condition='driver.wuu.condition_id'>
      <description>WUU Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXW716C/drivers/fsl_wuu.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXW716C/drivers/fsl_wuu.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXW716C/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='misc_utilities' Cversion='1.1.1' condition='utilities.misc_utilities.condition_id'>
      <description>
        Utilities which is needed for particular toolchain like the SBRK function required to address limitation between HEAP and STACK in GCC toolchain library.
      </description>
      <files>
        <file condition='allOf.toolchains=armgcc.condition_id' category='sourceC' name='devices/MCXW716C/utilities/fsl_syscall_stub.c' projectpath='utilities'/>
        <file condition='allOf.toolchains=armgcc.condition_id' category='sourceC' name='devices/MCXW716C/utilities/fsl_sbrk.c' projectpath='utilities'/>
        <file condition='allOf.toolchains=armgcc, mdk, cores=cm33.condition_id' category='sourceAsm' name='devices/MCXW716C/utilities/fsl_memcpy.S' projectpath='utilities'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='unity' Cversion='2.1.0' condition='utilities.unity.condition_id'>
      <description>Simple Unit Testing for C</description>
      <RTE_Components_h>
#ifndef UNITY_CUSTOM_OUTPUT_CHAR
#define UNITY_CUSTOM_OUTPUT_CHAR 
#endif
</RTE_Components_h>
      <files>
        <file category='sourceC' name='devices/MCXW716C/utilities/unity/unity.c' projectpath='utilities/unity'/>
        <file category='header' name='devices/MCXW716C/utilities/unity/unity.h' projectpath='utilities/unity'/>
        <file category='header' name='devices/MCXW716C/utilities/unity/unity_internals.h' projectpath='utilities/unity'/>
        <file category='include' name='devices/MCXW716C/utilities/unity/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='assert' Cversion='1.0.0' condition='utility.assert.condition_id'>
      <description>Utility assert</description>
      <files>
        <file category='header' name='devices/MCXW716C/utilities/fsl_assert.h' projectpath='utilities'/>
        <file category='sourceC' name='devices/MCXW716C/utilities/fsl_assert.c' projectpath='utilities'/>
        <file category='include' name='devices/MCXW716C/utilities/'/>
      </files>
    </component>
